* ownCloud Quick Start Guide on Ubuntu 18.04
** Abstract
:LOGBOOK:
CLOCK: [2020-12-10 Thu 16:54]--[2020-12-10 Thu 17:04] =>  0:10
:END:
*** Reference docs and additional resources
:LOGBOOK:
CLOCK: [2020-12-10 Thu 17:17]--[2020-12-10 Thu 17:26] =>  0:09
:END:
- [[https://doc.owncloud.org/][ownCloud Documentation]]
- [[https://www.youtube.com/channel/UC_4gez4lsWqciH-otOlXo5w][Official ownCloud YouTube channel]]
- [[https://www.youtube.com/channel/UCA8Ehsdu3KaxSz5KOcCgHbw][ownClouders Community YouTube channel]]
- [[https://owncloud.org/news/][ownCloud Planet for news and developer blogs]]
**** Manuals
- [[https://doc.owncloud.com/server/10.6/admin_manual/][ownCloud Adminstrator Manual]]
- [[https://doc.owncloud.com/server/10.6/user_manual/index.html][ownCloud User Manual]]
- [[https://doc.owncloud.com/desktop/][ownCloud Desktop Client]]
- [[https://doc.owncloud.com/android/][ownCloud Android App]]
- [[https://doc.owncloud.com/ios/][ownCloud iOS App]]

** Installing and configuring an ownCloud Server on Ubuntu 18.04
:LOGBOOK:
CLOCK: [2020-12-10 Thu 17:40]--[2020-12-10 Thu 18:38] =>  0:58
:END:
https://doc.owncloud.com/server/admin_manual/installation/ubuntu_18_04.html

*** Assumptions
*** Officially Recommended Environment
Officially Recommended Environment
For best performance, stability, support, and full functionality we officially recommend and support:

| Platform         | Options                             |
|------------------+-------------------------------------|
| Operating System | Ubuntu 18.04 LTS                    |
| Database         | MariaDB 10+                         |
| Web server       | Apache 2.4 with prefork and mod_php |
| PHP Runtime      | 7.4                                 |

** Enabling users to connect to the ownCloud server
*** Via IP address and port 8080
https://doc.owncloud.com/desktop/advanced_usage/configuration_file.html#proxy-section
** Adding a user account
https://doc.owncloud.com/server/10.6/admin_manual/configuration/user/user_configuration.html
** Connecting to the ownCloud server via desktop or mobile client
https://doc.owncloud.com/ios/
https://doc.owncloud.com/android/
https://doc.owncloud.com/desktop/installing.html

